[
  {
    "paper_info": {
      "title": "There are no fundamental facts",
      "author": "Roberto Loss",
      "main_thesis": "Certain assumptions about metaphysical grounding entail that no fact is fundamental (ungrounded in other facts)."
    },
    "philosophical_moves": [
      {
        "move_name": "Church-Fitch Style Reductio for Grounding",
        "quote": "The argument against the existence of fundamental facts is the following: (1) GA ∧ G~GA assumption (2) GA 1, ∧-elimination (3) G~GA 1, ∧-elimination (4) ~GA 3, (FG) (5) GA∧~GA 2, 4, ∧-introduction (6) ~(GA ∧ G~GA) 1, 5, reductio (7) ~◊(GA ∧ G~GA) 6, (N) (8) (A∧~GA) → ◊(GA ∧ G~GA) (PG) (9) ~(A∧~GA) 7, 8, modus tollens (10) A → GA 9, logic. This argument proves (by generalization) that, for every A, if it is a fact that A, then it is a grounded fact that A, and thus that no fact is fundamental (i.e. ungrounded).",
        "context_notes": "[GA means 'it is a grounded fact that A'; (FG) says grounded facts are true; (PG) says conjunctions can possibly be grounded; (N) says provably false things are impossible]",
        "location": "Section 2",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "Understanding of grounding operator, logical possibility, and reductio ad absurdum",
        "mechanism": "Assumes both A and ~A could be grounded facts, derives contradiction through factivity of grounding, then uses modal reasoning to eliminate fundamental facts",
        "achievement": "Proves that all facts must be grounded, eliminating fundamental facts entirely",
        "pattern": "Take target concept X, assume both P and ~P could have property X, derive contradiction, use modal logic to eliminate ungrounded cases",
        "domain": "Metaphysics/grounding theory",
        "quality": "High",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      },
      {
        "move_name": "Inductive Plausibility Defense",
        "quote": "Jago claims that (P) can be defeasibly justified as follows. First, he argues that, quite plausibly, at least some of the truthmaker maximalist approaches on the market are logically consistent. Then he proceeds inductively and claims that the fact that it is clearly logically possible for some representative truths to have a truthmaker ('Obama is male; wombats are marsupials; 1 + 1 = 2; there is no greatest prime number; scarlet things are red') gives us 'warrant – not a proof, but reason nonetheless – to accept (P)' (Jago 2020: 42). Also, in the case of (PG), it appears possible to provide at least some defeasible reason for its truth.",
        "context_notes": "[(P) is the principle that every truth can possibly have a truthmaker; (PG) is the analogous principle for grounding]",
        "location": "Section 3",
        "classification": [
          "defensive",
          "constructive"
        ],
        "prerequisites": "Understanding of defeasible reasoning and inductive generalization",
        "mechanism": "Shows principle holds for clear cases, argues no clear counterexamples exist, concludes principle is prima facie plausible",
        "achievement": "Provides defeasible support for controversial metaphysical principle without claiming certainty",
        "pattern": "For controversial principle P: (1) show P holds for uncontroversial cases, (2) argue no clear counterexamples, (3) claim prima facie warrant",
        "domain": "General epistemology/justification",
        "quality": "High",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      },
      {
        "move_name": "Special Cases Restriction Maneuver",
        "quote": "However, even if we accept the existence of either essentialist facts or totality facts and their being 'ungroundable' in this weak sense of possibility, we can simply restrict (PG) to conjunctions of facts that are equivalent to neither essentialist facts nor totality facts. In this case, if the fact that A is neither an essentialist fact nor a totality fact, then most plausibly the same can be said of the fact that ~GA, so that the argument just given can be used to argue that there are at least no fundamental facts that are neither essentialist facts nor totality facts – a result that is surely surprising enough on its own.",
        "context_notes": "[Responding to objection that essentialist facts and totality facts might be necessarily fundamental, which would violate the argument's assumptions]",
        "location": "Section 4",
        "classification": [
          "defensive"
        ],
        "prerequisites": "Understanding of essentialist facts, totality facts, and scope restriction strategies",
        "mechanism": "When faced with potential counterexamples to universal claim, restrict scope to exclude problematic cases while maintaining substantive conclusion",
        "achievement": "Preserves main argument by acknowledging limitations while showing result remains philosophically significant",
        "pattern": "When universal claim faces counterexamples: (1) acknowledge the exceptions, (2) restrict scope appropriately, (3) argue restricted conclusion still philosophically important",
        "domain": "General defensive strategy",
        "quality": "High",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      },
      {
        "move_name": "Autonomous Facts Alternative Principle",
        "quote": "However, in order to ward off this objection it appears sufficient to replace (PG) with the following, similarly plausible principle: (PG+) (◊GA ∧ (A ∧ B)) → ◊(GA ∧ B). (PG+) says that if it is the case that A ∧ B and the fact that A is 'groundable', then it is possible for B to be the case and for the fact that A to be a grounded fact. The same train of thought used above to defend (PG) can also be used to defend (PG+). Equipped with (PG+) we can then argue as follows: [formal argument follows] This argument proves (by generalization) that every groundable fact is grounded.",
        "context_notes": "[Responding to Dasgupta's objection that some facts might be 'autonomous' - not apt to be grounded at all]",
        "location": "Section 4",
        "classification": [
          "defensive",
          "constructive"
        ],
        "prerequisites": "Understanding of Dasgupta's autonomous facts distinction and modal logic",
        "mechanism": "When original principle faces objection, construct weaker but sufficient alternative principle that avoids the problem while preserving the argument's force",
        "achievement": "Maintains argumentative power while accommodating legitimate objection about autonomous facts",
        "pattern": "When principle P faces objection O: (1) construct weaker principle P+ that avoids O, (2) show P+ still sufficient for main conclusion, (3) argue P+ equally plausible as P",
        "domain": "General defensive strategy",
        "quality": "High",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      },
      {
        "move_name": "Question-Begging Dismissal",
        "quote": "Finally, one may object that what the present argument shows is simply that truths of the form 'A ∧ ~GA' are counterexamples to both (PG) and (PG+). However, as Jago (2020: 43) notices in relation to his argument, this move appears to be dialectically ineffective in this case, as it consists in simply assuming the falsity of what is at stake, namely, the existence of fundamental facts (since if 'A ∧ ~GA' is true, then the fact that A is a fundamental fact).",
        "context_notes": "[Addressing objection that the argument's problematic cases are simply counterexamples to the key principles]",
        "location": "Section 4",
        "classification": [
          "defensive"
        ],
        "prerequisites": "Understanding of dialectical effectiveness and question-begging",
        "mechanism": "Shows that proposed counterexample assumes the very thing being argued against, making the objection dialectically circular",
        "achievement": "Deflects objection by revealing its dialectical illegitimacy rather than addressing it on substance",
        "pattern": "When opponent offers counterexample C to principle P: show that C presupposes the falsity of your conclusion, making the objection question-begging",
        "domain": "General dialectical strategy",
        "quality": "Medium",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      },
      {
        "move_name": "Disanalogy Defense Against Overgeneralization",
        "quote": "Similarly, the present argument cannot be said to prove too much, as (PG), (PG*) and (PG+) appear to have far less appeal when applied to other notions, such as knowledge or belief. Consider, for instance, the following counterpart of (PG+) in which the operator 'G' is replaced with the operator 'K' standing for 'Frege knew that': (KPG+) (◊KA ∧ (A ∧ B)) → ◊(KA ∧ B). In this case, it is uncontroversial that there are some truths that Frege didn't know: for instance, that Neptune has fourteen moons. Therefore, in order to show the falsity of (KPG+) it is sufficient to replace B with '~KA', and A with any truth that clearly Frege didn't know. Instead, in the case of (PG+), there seem to be no truths that can clearly and uncontroversially be said to be metaphysically fundamental.",
        "context_notes": "[Defending against objection that the argument form proves too much when applied to other domains]",
        "location": "Section 4",
        "classification": [
          "defensive"
        ],
        "prerequisites": "Understanding of argument forms and domain-specific differences",
        "mechanism": "Shows that argument form fails in other domains due to clear counterexamples, but succeeds in target domain because no clear counterexamples exist",
        "achievement": "Defends argument against overgeneralization worry by showing domain-specific features make the difference",
        "pattern": "When accused of proving too much: (1) apply argument form to other domain, (2) show it fails there due to clear counterexamples, (3) argue target domain lacks such clear counterexamples",
        "domain": "General defensive strategy",
        "quality": "High",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      },
      {
        "move_name": "Abyss Consequence Acknowledgment",
        "quote": "In fact, assuming (as it is quite standard, if not completely uncontroversial) that grounding is irreflexive, asymmetric and transitive, and so there are no grounding 'loops', this entails that every fact (or every 'normal' fact in the sense specified above) is an 'abyss' – that is, a 'derivative [fact] having no fundamental ground and lying at the top of an infinitely descending chain of ground' (Loss 2016: 43) – which surely seems to be rather controversial. Some may take this to be a bad-company objection to Jago's argument. However, what Jago says in defence of his argument has at least the ring of plausibility to it. I think therefore that the argument presented in this paper can be seen as simply establishing that there is a short and direct way to provide at least some minimal support to the idea that there are no fundamental facts.",
        "context_notes": "[Concluding discussion of the argument's implications]",
        "location": "Section 5",
        "classification": [
          "meta"
        ],
        "prerequisites": "Understanding of grounding's formal properties and infinite regress concerns",
        "mechanism": "Acknowledges that argument leads to controversial metaphysical picture, but maintains this doesn't undermine the argument's dialectical value",
        "achievement": "Frames surprising consequence as philosophically interesting rather than problematic, managing reader expectations",
        "pattern": "When argument leads to surprising consequence C: (1) acknowledge C is controversial, (2) show C follows from plausible premises, (3) frame as providing 'minimal support' rather than proof",
        "domain": "General meta-argumentative strategy",
        "quality": "High",
        "source_paper": "There are no fundamental facts",
        "source_author": "Roberto Loss"
      }
    ],
    "extraction_notes": "This paper exemplifies sophisticated formal argumentation in metaphysics, combining modal logic with grounding theory. The moves show how to adapt successful argument patterns (Church-Fitch) to new domains, defend controversial principles through inductive reasoning, and manage objections through scope restrictions and alternative formulations. The author is particularly skilled at dialectical positioning, acknowledging limitations while maintaining argumentative force.",
    "source_file": "anaa008.txt"
  },
  {
    "paper_info": {
      "title": "Moderate pragmatic invariantism and contextual implicature cancellation",
      "author": "Michael Blome-Tillmann",
      "main_thesis": "MPI fails because its crucial implicatures disappear in contexts where the implicated content is already in the common ground, undermining its explanation of knowledge attributions"
    },
    "philosophical_moves": [
      {
        "move_name": "Analogical Validation Through Parallel Cases",
        "quote": "The resulting view has been criticized for being ad hoc, but it is, in fact, rather plausible. Consider, for illustration, some recognized cases of implicature, where the bracketed sentence expresses the conversationally implicated content: (6) A: Is Karl a good philosopher? B: He's got a beautiful handwriting. [Karl is not a good philosopher.] (7) A: Are you going to the party tonight? B: I don't like parties. [B will not go to the party tonight.] (8) H: I've been at the bank two weeks ago on a Saturday, and it was open. S: Banks do change their hours. H: You're right. I don't know that the bank will be open on Saturday. [H cannot rule out that the bank has changed its hours recently.] The bracketed contents in (6)–(8) are, intuitively, conveyed by the relevant utterances or suggested in some other way, but they are not part of what is said. These intuitions are hard to deny.",
        "context_notes": "[MPI = Moderate Pragmatic Invariantism, which claims knowledge denials pragmatically implicate specific content]",
        "location": "Section 1",
        "classification": [
          "defensive",
          "constructive"
        ],
        "prerequisites": "Understanding of pragmatic implicature and the distinction between what is said vs. what is conveyed",
        "mechanism": "Demonstrates that a controversial philosophical claim follows the same pattern as uncontroversial cases, thereby lending it credibility",
        "achievement": "Defends MPI against the charge of being ad hoc by showing its implicature behaves like standard cases",
        "pattern": "When theory T is criticized as implausible, show that T's mechanisms parallel widely accepted cases in the same domain",
        "domain": "General - applicable across philosophy of language, ethics, metaphysics",
        "quality": "High",
        "source_paper": "Moderate pragmatic invariantism and contextual implicature cancellation",
        "source_author": "Michael Blome-Tillmann"
      },
      {
        "move_name": "Mechanism-Testing Through Systematic Variation",
        "quote": "An important property of conversational implicatures arising from an utterance of a certain form of words is that they do not arise in every context in which that form of words is uttered. In particular, conversational implicatures that are otherwise present usually disappear in contexts in which the implicated content is already part of the common ground: (6') A: Is Karl a good philosopher? B: No, he isn't. But he's got a beautiful handwriting. (7') A: Are you going to the party tonight? B: No, I won't go. I don't like parties. As (6') and (7') illustrate, if we explicitly assert the otherwise implicated content, and thereby add it to the common ground before the utterance in question is made, the original implicature is blocked or suspended.",
        "context_notes": "[Building on the established cases (6) and (7) from the previous move]",
        "location": "Section 2",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of conversational implicature and common ground in pragmatics",
        "mechanism": "Identifies a general principle about implicatures, then tests it systematically across multiple cases to establish its reliability",
        "achievement": "Establishes the contextual suspension principle as a reliable test for genuine implicatures",
        "pattern": "When mechanism M is proposed, test M across varied contexts to identify its scope and limits",
        "domain": "General - applicable to testing any proposed mechanism or principle",
        "quality": "High",
        "source_paper": "Moderate pragmatic invariantism and contextual implicature cancellation",
        "source_author": "Michael Blome-Tillmann"
      },
      {
        "move_name": "Consistency Trap Through Principle Application",
        "quote": "Interestingly, the very phenomenon just described can also be observed with respect to (8): (8') H: I've been at the bank two weeks ago on a Saturday, and it was open. S: Banks do change their hours. H: You're right. I can't rule that out. I don't know that the bank will be open on Saturday. Hannah's 'knowledge'-denial in (8') intuitively does not convey that she cannot rule out that the bank has changed its hours. That is so because, in (8'), the proposition that Hannah cannot rule out that the bank has changed its hours recently is explicitly stated, and thus has been added to the common ground before Hannah utters her 'knowledge'-denial. Thus, (8') relates to (8) just as (6') relates to (6), and (7') to (7). The implicature at issue behaves in exactly the same way as other examples of recognized implicature.",
        "context_notes": "[Case (8) was MPI's key example where knowledge denials supposedly implicate inability to rule out alternatives]",
        "location": "Section 2",
        "classification": [
          "offensive"
        ],
        "prerequisites": "Acceptance of the contextual suspension principle and MPI's commitment to treating their cases like standard implicatures",
        "mechanism": "Forces the opponent to apply their own accepted principles consistently, revealing unwelcome consequences",
        "achievement": "Shows that MPI's key cases lose their implicatures in the very contexts where they need them most",
        "pattern": "If opponent accepts principle P and case C, show that P applied to C yields consequences that undermine opponent's position",
        "domain": "General - applicable wherever principles have universal scope",
        "quality": "High",
        "source_paper": "Moderate pragmatic invariantism and contextual implicature cancellation",
        "source_author": "Michael Blome-Tillmann"
      },
      {
        "move_name": "Explanatory Collapse Through Context Shifting",
        "quote": "Is this good news for the defenders of MPI? It is decisively bad news. The crucial point about (8') is that Hannah's (allegedly false) knowledge denial does not carry the (true) implicature that Hannah cannot rule out that the bank has changed its hours. But if it does not carry that (true) implicature, then MPI's explanation of our truth-value intuitions is not available with respect to (8'). Remember that, with respect to (8), our intuitions were meant to track the truth-value of the implicature (true) rather than the truth-value of what is said (false). In (8') there is no implicature that could take over this role, so our intuitions about the 'knowledge'-attribution in (8') must track the truth-value of what is said. But what is said is, according to MPI, false.",
        "context_notes": "[MPI explains our intuitions by claiming we track implicatures rather than semantic content]",
        "location": "Section 2",
        "classification": [
          "offensive"
        ],
        "prerequisites": "Understanding of MPI's explanatory strategy and the role of implicatures in accounting for intuitions",
        "mechanism": "Shows that when the opponent's explaining mechanism disappears, their explanation collapses and predictions fail",
        "achievement": "Demonstrates that MPI cannot account for intuitions in modified contexts where implicatures are suspended",
        "pattern": "If theory T explains phenomenon X via mechanism M, show contexts where M is absent but X persists, forcing T to make false predictions",
        "domain": "General - applicable to any theory that explains data through intermediate mechanisms",
        "quality": "High",
        "source_paper": "Moderate pragmatic invariantism and contextual implicature cancellation",
        "source_author": "Michael Blome-Tillmann"
      },
      {
        "move_name": "Intuitive Redundancy Test",
        "quote": "Could Hannah's 'knowledge'-denial nevertheless carry the implicature at issue, even though it does not seem that way at first sight? There are cases in which a proposition is explicitly stated and then, in a follow-up speech act, immediately implicated. Here are two examples: (9) You're very special to me. You're the cream in my coffee! (10) I've been waiting for a very long time. In fact, I've been waiting for ages! These speech acts have a clear air of redundancy. By asserting the second sentence in (9) the speaker figuratively conveys what she has already explicitly stated – that the addressee is very special to her. Since Hannah's utterance in High Stakes* is not repetitive or redundant in the same manner as (9) and (10) are, I conclude that Hannah's 'knowledge'-denial in High Stakes* does not conversationally implicate or convey in any other sense that Hannah cannot rule out that the bank has changed its hours.",
        "context_notes": "[High Stakes* is the modified version where Hannah explicitly states she can't rule out changed hours before denying knowledge]",
        "location": "Section 2",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "Understanding of conversational implicature and the distinction between genuine vs. apparent implicature",
        "mechanism": "Uses intuitive judgments about redundancy to test whether alleged implicatures are genuine, comparing clear cases of redundancy with the disputed case",
        "achievement": "Provides an empirical test for distinguishing genuine implicatures from cases where implicatures are absent",
        "pattern": "When disputed whether X carries implicature I, compare X with clear cases of redundant implicature and test for similar redundancy feelings",
        "domain": "Philosophy of language, but pattern applicable to testing any claim about implicit content",
        "quality": "Medium",
        "source_paper": "Moderate pragmatic invariantism and contextual implicature cancellation",
        "source_author": "Michael Blome-Tillmann"
      }
    ],
    "extraction_notes": "The paper demonstrates sophisticated argumentative structure, moving from defensive validation through analogical cases to offensive application of the opponent's own principles. The moves show how to systematically test philosophical mechanisms and exploit consistency requirements. Particularly notable is the strategy of establishing a principle through uncontroversial cases, then applying it to controversial cases to generate decisive counterexamples.",
    "source_file": "anaa035.txt"
  },
  {
    "paper_info": {
      "title": "An argument against causal decision theory",
      "author": "Jack Spencer",
      "main_thesis": "Causal decision theory is false because rational agents satisfy the Guaranteed Principle while agents who embody CDT do not."
    },
    "philosophical_moves": [
      {
        "move_name": "Methodological Reorientation via Principle Construction",
        "quote": "Critics of causal decision theory (CDT) have put forward various alleged counterexamples: cases in which, they claim, rationality and the recommendations of CDT diverge. For the most part, proponents of CDT have been unconvinced, viewing the intuitions the alleged counterexamples elicit with a mixture of suspicion and opposition. The dispute is thus at an impasse, and one worries that unless there is some way to move beyond judgements about cases, the dispute will devolve into an unproductive clash of intuitions. My goal in this paper is move beyond the impasse. I criticize CDT, not by appeal to judgements about cases, but by explicit argument. I formulate a principle of preference, which I call the Guaranteed Principle. I argue that the preferences of rational agents satisfy the Guaranteed Principle, that the preferences of agents who embody CDT do not, and hence that CDT is false.",
        "context_notes": "",
        "location": "Section 1",
        "classification": [
          "meta",
          "constructive"
        ],
        "prerequisites": "Understanding of ongoing debates about decision theory and counterexample methodology",
        "mechanism": "Diagnoses methodological stalemate, then proposes alternative approach using explicit principle rather than case intuitions",
        "achievement": "Reframes debate from intuition-based to principle-based argumentation",
        "pattern": "When X methodology leads to stalemate, propose Y methodology that avoids the problematic features of X",
        "domain": "General",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Intuitive Principle Motivation via Choice Architecture",
        "quote": "Say that a decision guarantees $n if the agent knows that some particular option made available by the decision would yield $n if chosen; and say that a decision forces $n if the agent knows that every option made available by the decision would yield $n if chosen. If we assume that agents satisfy certain simplifying assumptions, care only about money and value dollars linearly, then we can formulate the Guaranteed Principle as follows: (Guaranteed Principle) A rational agent always strictly prefers a decision that guarantees $n to a decision that forces $m < $n. The motivation for the Guaranteed Principle is straightforward: a rational agent never strictly prefers fewer options. If d1 is a decision that forces $n, and d2 is just like d1 except that it makes additional options available, then a rational agent weakly prefers d2 to d1. And a rational agent strictly prefers d1 to some decision, d0, which forces $m < $n. So, by transitivity, we get the Guaranteed Principle.",
        "context_notes": "",
        "location": "Section 2",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Basic understanding of rational choice and preference relations",
        "mechanism": "Defines key terms, states principle, then provides intuitive justification based on option value and transitivity",
        "achievement": "Establishes plausible normative principle with clear intuitive backing",
        "pattern": "Define technical terms → State principle → Provide intuitive justification via simpler, widely accepted claims",
        "domain": "Decision theory",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Scope Limitation via Idealization Defense",
        "quote": "The Guaranteed Principle does not hold of imperfect agents, nor of agents who expect to be imperfect. Take an extreme illustration. Suppose that the least choiceworthy option made available by a decision that guarantees $n is very bad indeed, and suppose that I have a lesion that makes me choose from among the least choiceworthy options when I face decisions of that sort. Then, as a way of protecting myself from my disposition to choose irrationally, I should prefer the decision that forces $m to the decision that guarantees $n > $m. But the Guaranteed Principle does not purport to hold true of imperfect agents. It is restricted to (perfectly) rational agents: the idealized agents that are the subject matter of decision theory. If an agent fully expects to choose from among the most choiceworthy options, as rational agents always do, then the agent must strictly prefer a decision that guarantees $n to a decision that forces $m < $n.",
        "context_notes": "",
        "location": "Section 2",
        "classification": [
          "defensive"
        ],
        "prerequisites": "Understanding of the Guaranteed Principle and potential counterexamples",
        "mechanism": "Acknowledges apparent counterexample, then restricts scope of principle to idealized agents where counterexample doesn't apply",
        "achievement": "Protects principle from obvious objections while maintaining theoretical relevance",
        "pattern": "Acknowledge apparent counterexample → Restrict scope to domain where counterexample doesn't apply → Justify restriction as theoretically appropriate",
        "domain": "General",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Case Construction for Theory Testing",
        "quote": "I am going to use the Guaranteed Principle to argue that a particular alleged counterexample to CDT succeeds. The example I will focus on is the following one, from Spencer and Wells (2019: 34): (The Frustrater) There is an envelope and two opaque boxes, A and B. The agent has three options: she can take A, B or the envelope (aA, aB or aE). The envelope contains $40. The two boxes together contain $100. How the money is distributed between the boxes depends on a prediction made yesterday by the Frustrater, a reliable predictor who seeks to frustrate. If the Frustrater predicted that the agent would take A, then B contains $100. If the Frustrater predicted that the agent would take B, then A contains $100. If the Frustrater predicted that the agent would take the envelope, each box contains $50. The agent knows all of this. There is a strong intuition that rationality requires taking the envelope. CDT, however, does not recommend the envelope.",
        "context_notes": "",
        "location": "Section 3",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of CDT and how decision scenarios can test theories",
        "mechanism": "Presents carefully constructed scenario where intuitive rational choice conflicts with theory's recommendation",
        "achievement": "Creates test case that separates competing theoretical approaches",
        "pattern": "Construct scenario where theory T recommends action X but intuition/competing principle recommends action Y",
        "domain": "Decision theory",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Technical Calculation to Support Intuition",
        "quote": "According to CDT, an agent should always choose so as to maximize U. [Technical definitions follow] The agent facing The Frustrater knows that the envelope contains $40, so, equating dollars and units of value, U(aE) = 40. The agent does not know how the money is distributed between the boxes, but knows that the boxes together contain $100. Therefore, no matter how the agent divides her credence, U(aA) + U(aB) = 100. Two numbers smaller than 40 cannot sum to 100, so, no matter how the agent divides her credence, aA and/or aB maximize U.",
        "context_notes": "[Technical definitions of V-value and U-value provided earlier in quote]",
        "location": "Section 3",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of CDT's formal apparatus and utility calculations",
        "mechanism": "Uses theory's own formal machinery to show it recommends counterintuitive choice",
        "achievement": "Demonstrates conflict between theory and intuition using theory's own standards",
        "pattern": "Apply theory's formal methods to show it generates counterintuitive results in test case",
        "domain": "Decision theory",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Bridge Case Construction for Principle Application",
        "quote": "To get the argument going, consider the following elaboration of The Frustrater: (Two Rooms) An agent must enter either Room #1 or Room #2. If she enters Room #1, she gets $35. If she enters Room #2, she faces The Frustrater. The agent knows all of this. The 'decision' in Room #1 forces $35. The decision in Room #2 – namely, The Frustrater – guarantees $40. The Guaranteed Principle thus entails that a rational agent strictly prefers Room #2 to Room #1.",
        "context_notes": "[The Frustrater case was described earlier as a scenario with envelope containing $40 and boxes with various amounts]",
        "location": "Section 4",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of the Guaranteed Principle and The Frustrater case",
        "mechanism": "Embeds original case within new choice structure that makes principle directly applicable",
        "achievement": "Creates scenario where principle gives clear verdict that can be tested against theory",
        "pattern": "Embed problematic case X within larger choice structure Y to make principle Z directly applicable",
        "domain": "Decision theory",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Formal Contradiction via Premise Derivation",
        "quote": "If CDT is true, then a rational agent embodies CDT. So we have the first premiss of the argument, which is a claim of material implication: (P1) If CDT is true, then an agent who embodies CDT strictly prefers Room #2 to Room #1. The second premiss is a claim about the pairwise preferences of an agent who embodies CDT: (P2) An agent who embodies CDT strictly prefers Room #1 to Room #2. [Extended calculation follows showing P2 is true] The two premisses of the argument entail the falsity of CDT. I have argued that both premisses are true. So I think that we have here a sound argument against CDT.",
        "context_notes": "[Context: 'Say that an agent embodies a decision theory just if the agent knows that she always chooses an option recommended by the decision theory']",
        "location": "Section 4",
        "classification": [
          "offensive"
        ],
        "prerequisites": "Understanding of the Two Rooms case, Guaranteed Principle, and CDT calculations",
        "mechanism": "Derives contradictory premises from theory plus principle, then uses detailed calculation to establish both premises",
        "achievement": "Generates formal refutation of theory through contradictory consequences",
        "pattern": "Show theory T plus principle P implies both Q and not-Q, therefore T is false",
        "domain": "Decision theory",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      },
      {
        "move_name": "Objection Anticipation via Alternative Formulation",
        "quote": "If there were diachronic (conjunctive, long-arm) options, then we might be able to reconcile CDT with the Guaranteed Principle. An agent facing Two Rooms would have four diachronic options: a1, aA, aB and aE. [Extended analysis follows] But, unfortunately for CDT, there are no such things. An agent deciding between Room #1 and Room #2 faces a straight choice between two (real, synchronic) options. And if the agent embodies CDT, the agent will choose Room #1, since U(a1) > U(a2). Therefore, (P2) is true.",
        "context_notes": "[Context: This addresses potential objection that CDT could handle the case if we allowed compound actions across time]",
        "location": "Section 4",
        "classification": [
          "defensive"
        ],
        "prerequisites": "Understanding of synchronic vs. diachronic options in decision theory",
        "mechanism": "Considers sophisticated objection, shows how it might work, then argues it fails on metaphysical grounds",
        "achievement": "Strengthens argument by addressing most plausible escape route for opponent",
        "pattern": "Consider objection 'What if we modify framework in way X?' → Show how X might help → Argue X is unavailable/implausible",
        "domain": "Decision theory",
        "quality": "High",
        "source_paper": "An argument against causal decision theory",
        "source_author": "Jack Spencer"
      }
    ],
    "extraction_notes": "This paper demonstrates sophisticated philosophical argumentation through methodological innovation (moving from case-based to principle-based criticism), careful case construction, and formal derivation of contradictions. Spencer's moves show how to combine intuitive principles with technical apparatus to generate decisive arguments against established theories.",
    "source_file": "anaa037.txt"
  },
  {
    "paper_info": {
      "title": "Primitive conditional probabilities, subset relations and comparative regularity",
      "author": "Joshua Thong",
      "main_thesis": "De Finetti, Hájek, and Easwaran's proposals for ordering events using conditional credences and subset relations fail because they deliver wrong verdicts for disjoint possible events with equal positive credence."
    },
    "philosophical_moves": [
      {
        "move_name": "Infinite Lottery Counterexample",
        "quote": "It is well understood that if rational credences are real-valued, then there are some possible events that are assigned 0 credence nonetheless, for example a particular ticket winning in a fair infinite lottery. After all, in any fair lottery, Cr({i}) = Cr({j}), where i and j are tickets in the lottery. Since there are infinitely many tickets in a fair infinite lottery, Cr({i}) < 1/n for all n ∈ N. If rational credences are real-valued, then Cr({i}) = 0. However, an impossible event, denoted by ∅, is also assigned 0 credence, that is, Cr(∅) = 0. Is S therefore equally confident in {i} as in ∅, that is, is she equally confident in ticket i winning as in an impossible event obtaining? To say yes seems counter-intuitive.",
        "context_notes": "[Cr represents credence function, {i} represents ticket i, ∅ represents impossible event]",
        "location": "Section 1",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "Understanding of probability theory and credence functions",
        "mechanism": "Uses mathematical properties of infinite sequences to show that possible events can have zero credence, creating paradox",
        "achievement": "Establishes the core problem that motivates the entire debate about how to order events",
        "pattern": "Use extreme mathematical cases to reveal conceptual problems in standard theories",
        "domain": "Epistemology/probability theory",
        "quality": "High",
        "source_paper": "Primitive conditional probabilities, subset relations and comparative regularity",
        "source_author": "Joshua Thong"
      },
      {
        "move_name": "Systematic Constraint Articulation",
        "quote": "Hereafter, I assume that ≼ respects the following four constraints. Let Ω be a sample space and F be an algebra on Ω. For all A, B, C ∈ F, (Non-Negativity) ∅ ≼ A. (Non-Triviality) ∅ ≺ Ω. (Transitivity) If A ≼ B and B ≼ C, then A ≼ C. (Comparative Additivity) Let A ∩ C = B ∩ C = ∅. Then A ≼ B iff A ∪ C ≼ B ∪ C. These four constraints are common across all major axiomatizations of comparative confidence orderings, for example Keynes 1921, de Finetti 1937, Koopman 1940, Luce 1968, Domotor 1969, Krantz et al. 1971 and Fine 1973.",
        "context_notes": "[≼ represents 'at most as confident as' relation, ≺ represents 'less confident than']",
        "location": "Section 2",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "Basic understanding of formal logic and set theory",
        "mechanism": "Establishes formal framework by listing widely accepted constraints with authoritative support",
        "achievement": "Creates neutral ground for evaluating competing proposals by using uncontroversial assumptions",
        "pattern": "Establish formal framework using constraints that opponents cannot reasonably reject",
        "domain": "General philosophical methodology",
        "quality": "High",
        "source_paper": "Primitive conditional probabilities, subset relations and comparative regularity",
        "source_author": "Joshua Thong"
      },
      {
        "move_name": "Precision Counterexample Construction",
        "quote": "Since [0.1, 0.2] ∼ [0.8, 0.9], [0.1, 0.2) ≺ [0.8, 0.9] for a regular ≼. For a real-valued Cr representing a fair lottery over [0, 1], Cr([0.1, 0.2)) = Cr([0.8, 0.9]) = 0.1, as Cr({0.2}) = 0. Consequently Cr([0.1, 0.2), [0.1, 0.2) ∪ [0.8, 0.9]) = Cr([0.8, 0.9], [0.1, 0.2) ∪ [0.8, 0.9]) = 0.5. Note that [0.1, 0.2) ⊈ [0.8, 0.9]. Therefore, according to Proper Containment, Conditionality and Symmetric Difference, [0.1, 0.2) ⊀ [0.8, 0.9], which is the wrong verdict.",
        "context_notes": "[Context: The author has established that in a regular confidence ordering, we should have [0.1, 0.2) ≺ [0.8, 0.9] because [0.1, 0.2] ∼ [0.8, 0.9] by fairness and length-ordering constraints, but [0.1, 0.2) is missing the endpoint 0.2]",
        "location": "Section 2",
        "classification": [
          "offensive"
        ],
        "prerequisites": "Understanding of the three competing proposals and interval notation",
        "mechanism": "Constructs specific mathematical case where intuitive ordering conflicts with all three formal proposals",
        "achievement": "Definitively refutes all three competing proposals simultaneously",
        "pattern": "Find precise mathematical case that satisfies assumptions but yields wrong conclusion according to target theories",
        "domain": "Mathematical philosophy",
        "quality": "High",
        "source_paper": "Primitive conditional probabilities, subset relations and comparative regularity",
        "source_author": "Joshua Thong"
      },
      {
        "move_name": "Dialectical Positioning Hedge",
        "quote": "Importantly, the counterexample in the next section is not intended to be a knockdown argument against the position held by the three authors above. After all, for all we know, there may be a fourth proposal that fares better than the three above. That is, there may be a correct general proposal of the form 'A ≺ B iff an appropriate relation R(Cr, A, B) holds', where ∅ ≺ A for all nonempty A ∈ F and Cr is a real-valued credence function representing the epistemic state of a rational agent S, who has the comparative confidence ordering on the left-hand side.",
        "context_notes": null,
        "location": "Section 1",
        "classification": [
          "meta",
          "defensive"
        ],
        "prerequisites": "Understanding of philosophical argument structure and burden of proof",
        "mechanism": "Explicitly limits scope of criticism while maintaining that burden of proof shifts to opponents",
        "achievement": "Prevents overinterpretation while maintaining argumentative pressure on target position",
        "pattern": "Limit criticism to specific proposals while keeping general research program viable but burdened",
        "domain": "General philosophical methodology",
        "quality": "High",
        "source_paper": "Primitive conditional probabilities, subset relations and comparative regularity",
        "source_author": "Joshua Thong"
      },
      {
        "move_name": "Escape Route Analysis",
        "quote": "Perhaps they should be content with a partial representation of S's comparative confidence ordering, for example if Cr(A, A ∪ B) < Cr(B, A ∪ B), then A ≺ B; this is just the right-to-left direction of Conditionality. Recall that the counterexample above is against the left-to-right directions of all three proposals in §1. So dropping that direction is one escape route. By just adopting the right-to-left direction of any one proposal in §1, we can avoid the counterexample, but still ensure that S is more confident in any possible event than in an impossible event, yet her rational credences are entirely real-valued.",
        "context_notes": "[Context: The counterexample showed that when [0.1, 0.2) ≺ [0.8, 0.9] but the proposals incorrectly predict [0.1, 0.2) ⊀ [0.8, 0.9], this attacks the left-to-right direction of biconditionals like 'A ≺ B iff Cr(A, A ∪ B) < Cr(B, A ∪ B)']",
        "location": "Section 2",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "Understanding of biconditionals and their directional components",
        "mechanism": "Identifies which logical direction of target proposals survives the counterexample and shows this still serves opponents' main goals",
        "achievement": "Provides opponents with viable retreat position while showing costs of that retreat",
        "pattern": "After refuting biconditional, analyze which direction survives and what theoretical costs this imposes",
        "domain": "General philosophical methodology",
        "quality": "Medium",
        "source_paper": "Primitive conditional probabilities, subset relations and comparative regularity",
        "source_author": "Joshua Thong"
      },
      {
        "move_name": "Derivative Argument Undermining",
        "quote": "However, my counterexample shows that both replacements are false. This is because [0.8, 0.9] ≻ [0.1, 0.2), yet [0.1, 0.2) ⊈ [0.8, 0.9], Cr([0.8, 0.9]) = Cr([0.1, 0.2)) and Cr([0.8, 0.9], [0.1, 0.2) ∪ [0.8, 0.9]) = Cr([0.1, 0.2), [0.1, 0.2) ∪ [0.8, 0.9]) for a real-valued Cr. Thus Easwaran's attack on the argument above is unsuccessful.",
        "context_notes": "[Context: Easwaran had argued against regularity by rejecting premise 2 'If p is more likely than q for a rational agent, then Cr(p) > Cr(q)' and proposing two alternative conditions involving subset relations and conditional probabilities]",
        "location": "End of Section 2",
        "classification": [
          "offensive"
        ],
        "prerequisites": "Understanding of Easwaran's specific argument against regularity",
        "mechanism": "Shows that counterexample to main target also refutes related argument by same author",
        "achievement": "Extends scope of refutation beyond main target to related theoretical commitments",
        "pattern": "After establishing counterexample, identify other arguments by same authors that rely on refuted principles",
        "domain": "General philosophical methodology",
        "quality": "Medium",
        "source_paper": "Primitive conditional probabilities, subset relations and comparative regularity",
        "source_author": "Joshua Thong"
      }
    ],
    "extraction_notes": "This paper exemplifies precise mathematical counterexample construction in philosophical argument. The author skillfully uses formal constraints that opponents cannot reject, then constructs a specific case that reveals the inadequacy of their proposals. The dialectical positioning is particularly sophisticated, limiting the scope of criticism while maintaining argumentative pressure.",
    "source_file": "anad099 (1).txt"
  },
  {
    "paper_info": {
      "title": "Microaggression and ambiguous experience",
      "author": "Luke Brunning",
      "main_thesis": "Ambiguity is not constitutive of microaggression but rather an optional aggravating feature; structural accounts better capture the nature of microaggressions."
    },
    "philosophical_moves": [
      {
        "move_name": "Conceptual Distinction to Reveal Hidden Ambiguity",
        "quote": "Sarah could be clear that Mark's remark does instantiate oppression in contributing to a social process that marginalizes some people over others on grounds of ethnicity, while remaining unclear what Mark meant in saying what he said. Conversely, Sarah might be clear about what Mark meant, yet struggle to understand whether, or how, being asked where one is really from connects to oppressive social processes or is typically understood by others as a microaggression. Similarly, Mark's attempts to deflect away from accusations of microaggressing could involve disputing his intentions, for example by saying 'I didn't mean that by it', or by disputing the connections between his remark and oppression, for example by saying 'it has nothing to do with ethnicity'. Recognizing the possibility of drawing this distinction prompts the question: which form of ambiguity matters most when defining microaggression?",
        "context_notes": "[Context: Rini argues microaggressions are defined by victims experiencing ambiguity about whether behavior 'instantiates oppression'. Brunning is examining what this phrase means.]",
        "location": "Section 2.1",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "An opponent's key term that appears univocal but may be ambiguous",
        "mechanism": "Disambiguate a central concept by showing it has multiple interpretations, then force the opponent to choose which one they mean",
        "achievement": "Reveals that the opponent's definition is unclear and potentially excludes paradigmatic cases",
        "pattern": "When analyzing concept X, ask: 'X could mean X1 or X2. Which interpretation matters for your theory? Can your theory handle both?'",
        "domain": "General - applicable to any philosophical analysis involving ambiguous key terms",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      },
      {
        "move_name": "Paradigmatic Case Exclusion Objection",
        "quote": "More interestingly, what if Sarah is clear that the question 'Where are you really from?' does help sustain oppression? If so, she does not experience ambiguity in that sense (although she might still wonder what Mark meant by his words at that time). On Rini's ambiguous-experience account we would have to say Sarah is not a victim of a microaggression. But if not, then how are we to understand, and morally label, what Mark has done? If we want to resist suggesting he is overtly bigoted, we lack useful moral language here if we are unable to reach for the concept of microaggression. Insisting that ambiguity is constitutive of microaggressions seems to miss out some paradigm cases, which is implausible.",
        "context_notes": "[Context: Rini defines microaggressions as acts experienced with ambiguity about whether they instantiate oppression]",
        "location": "Section 2.1",
        "classification": [
          "offensive"
        ],
        "prerequisites": "A definition that makes some feature necessary for category membership",
        "mechanism": "Show that the proposed necessary condition excludes clear, central examples that should count as instances",
        "achievement": "Demonstrates the definition is too restrictive and fails to capture paradigmatic cases",
        "pattern": "If your definition requires feature F, but paradigmatic case P lacks F, then your definition excludes what it should include",
        "domain": "General - applicable to any definitional project in philosophy",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      },
      {
        "move_name": "Apology Practice Test",
        "quote": "Our intuitions about how to make amends to someone can help us appreciate our action's wrong-making features. How might Mark apologize to Sarah for his remark? There seem to be two options: he can apologize for the type of remark he made, or apologize for the way his particular words caused Sarah to experience ambiguity. Typically, we seem to want microaggressors to realize the social implications of their speech or actions, that is, address the type of remark or action. It would seem strange, I suggest, if Mark's apology were to focus instead on the fact that he caused Sarah to experience ambiguity.",
        "context_notes": "[Context: Testing Rini's view that ambiguity is constitutive of microaggression]",
        "location": "Section 2.2",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "A theory about what makes certain actions wrong",
        "mechanism": "Test the theory by examining what apologies for those actions focus on - if apologies don't address the theory's proposed wrong-making feature, this counts against the theory",
        "achievement": "Provides evidence that the theorized wrong-making feature is not what people actually treat as central to the wrongness",
        "pattern": "If your theory says X makes action A wrong, but apologies for A focus on Y rather than X, this suggests Y rather than X is the real wrong-making feature",
        "domain": "Ethics - particularly applicable to theories about wrongdoing and moral responsibility",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      },
      {
        "move_name": "External Cause Contamination",
        "quote": "Actions can also be experienced ambiguously for reasons of tiredness, stress, heightened emotions or being triggered by a recent event. The ambiguous-experience account risks encompassing Gettier-style cases where someone experiences a remark in an ambiguous way, the remark is actually connected to oppressive structures but the cause of their ambiguity experience is unrelated to oppression and has an external cause. More troublingly, on Rini's view, someone's fatigue might make them experience an overt slur as connected ambiguously to oppression. For example, they may fail to parse someone's remarks correctly, or attend to their body-language, or an aspect of context that makes clear the intended meaning of their speech or behaviour. It seems odd to say they are victims of a microaggression because of tiredness when they would be victims of bigotry if not tired.",
        "context_notes": "[Context: Examining Rini's view that microaggressions are defined by ambiguous experience]",
        "location": "Section 2.3",
        "classification": [
          "offensive"
        ],
        "prerequisites": "A theory that makes a particular kind of experience definitional",
        "mechanism": "Show that the relevant experience can be produced by factors unrelated to what the theory aims to capture, leading to misclassification",
        "achievement": "Demonstrates that experiential criteria can be contaminated by irrelevant external factors",
        "pattern": "If theory T defines phenomenon P by experience E, but E can be caused by factors unrelated to P, then T misclassifies cases",
        "domain": "General - applicable to any experiential or phenomenological approach to defining concepts",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      },
      {
        "move_name": "Third-Party Experience Manipulation",
        "quote": "Tom's intervention helps to corroborate the experience of Simone and Jane, who sensed that something was awry in the touches of these 'well-meaning' parents. He has the standing to make this intervention as someone from a racial minority who has a child who had similar experiences. But notice that his intervention dispels Simone's sense of ambiguity about what she's experiencing, which, if the ambiguous-experience account is correct, means that Simone is not subject to a microaggression. Similarly, Tom might encounter Sarah, from my example in §2.1, giving earnest replies to her colleague Mark's questions and might tactfully suggest to her later that those remarks carry connotations about ethnicity, nationality and belonging. As a result, his intervention could introduce ambiguity that she did not feel previously. As a bystander, Tom seems to have the power to make it the case, or make it not the case, that someone else is a victim of a microaggression as a consequence of his efforts to provide an interpretive perspective on remarks or actions they experience.",
        "context_notes": "[Context: Tom is a Black parent who can help others understand racial dynamics. Testing whether ambiguity is constitutive of microaggression.]",
        "location": "Section 2.4",
        "classification": [
          "offensive"
        ],
        "prerequisites": "A theory that makes a changeable mental state definitional of some objective phenomenon",
        "mechanism": "Show that third parties can manipulate the definitional mental state, leading to absurd consequences about when the phenomenon occurs",
        "achievement": "Reveals that making changeable subjective states definitional leads to implausible dependency on external interventions",
        "pattern": "If phenomenon P is defined by mental state M, and third parties can easily change M, then whether P occurs depends arbitrarily on third-party interventions",
        "domain": "General - applicable to theories that define objective phenomena through subjective experiences",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      },
      {
        "move_name": "False Methodological Inference Diagnosis",
        "quote": "This helps us understand how her account goes awry. Rini is certainly right that as a matter of good moral practice we should often be reluctant to intervene and challenge the experiences of other people, especially in situations where we are not members of a relevant social group or otherwise lack good standing. But recognition of this fact should not influence our underlying account of what microaggressions are. I might be hesitant to tell a stranger that someone raised a middle-finger to them behind their back, for example, but my reluctance – even if justified – does not shape my account of which actions are instances of swearing and which are not.",
        "context_notes": "[Context: Analyzing why Rini adopts a purely subjective approach to defining microaggressions]",
        "location": "Section 3",
        "classification": [
          "meta",
          "defensive"
        ],
        "prerequisites": "An opponent who conflates methodological constraints with theoretical commitments",
        "mechanism": "Distinguish between legitimate practical constraints on how we should engage with others versus what our theories should say about the phenomena themselves",
        "achievement": "Shows that good methodological practice doesn't require adopting a subjective theory of the phenomenon in question",
        "pattern": "Good practice requires epistemic humility about X, but this doesn't mean our theory of X must be purely subjective",
        "domain": "Meta-philosophical - applicable when opponents conflate methodological and theoretical considerations",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      },
      {
        "move_name": "Community Standing Redistribution",
        "quote": "Rini's account of microaggression tries to foreground this knowledge but does so in an overly individual way. She might be right to think that she lacks standing to question a Black women's experiences (as I also do), but this might not be true of other Black women or members of other minority groups. Members of the community, like Tom, can explain the connections between hair-touching, racial stereotypes and other dimensions of oppression and help people view certain token actions as instances of more broadly oppressive types. In some cases, such as being asked 'Where are you really from?', these associations might be well trodden and sit on the surface of collective experience. In other cases, however, some analysis might be required to discover whether an apparently innocent or well-meant interaction is linked to oppressive social structures.",
        "context_notes": "[Context: Addressing Rini's concern about lacking standing to challenge others' experiences, particularly around racial microaggressions]",
        "location": "Section 3",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "A theoretical problem based on concerns about epistemic authority or standing",
        "mechanism": "Acknowledge the standing concern but redistribute authority to members of the relevant community rather than requiring purely individual determination",
        "achievement": "Preserves respect for epistemic authority while avoiding overly subjective consequences",
        "pattern": "If individuals lack standing to judge phenomenon P, this doesn't require individual subjectivism - community members may have the relevant standing",
        "domain": "Social philosophy and epistemology - particularly applicable to issues involving oppression and marginalized communities",
        "quality": "High",
        "source_paper": "Microaggression and ambiguous experience",
        "source_author": "Luke Brunning"
      }
    ],
    "extraction_notes": "This paper demonstrates sophisticated philosophical argumentation through systematic objection-raising against a specific definition. Brunning employs multiple complementary strategies: conceptual disambiguation, paradigmatic case testing, practical consequence examination, and methodological critique. The moves show how to effectively challenge experiential or phenomenological approaches to definition while remaining sensitive to concerns about epistemic authority and social positioning.",
    "source_file": "anae044 (1).txt"
  },
  {
    "paper_info": {
      "title": "Two kinds of failure in joint action: On disrespect and directed duties",
      "author": "Guido Löhr",
      "main_thesis": "There are two distinct kinds of failure in joint action: failing to 'do our part' (contributing to the joint intention) and failing to respect our collaborators, which helps resolve debates about normativity in collective intentionality."
    },
    "philosophical_moves": [
      {
        "move_name": "Concrete Case Analysis with Dual Failure Detection",
        "quote": "Consider the following example: James and Paula are taking a walk together. James is ranting about the government but quickly realizes that Paula shows signs of discomfort. He immediately apologizes and continues the earlier, more successful, conversation about philosophy. But then James speeds up. This goes against Paula's intention to take a relaxing walk. 'Slow down, James! I don't want to walk so fast', she demands. John keeps walking and eventually, he is so far ahead of her that the ordinary concept of walking together no longer applies to them. Paula is confused. Did James not owe it to her to slow down? Did he not respect her enough to at least say goodbye? I argue that we can identify two distinct kinds of failure in Paula and James's joint action that have so far not been sufficiently distinguished in the debate on joint intention. One mistake is James's failure to contribute to the implicitly established joint intention to, say, have an interesting conversation, that is, to 'do his part' (to use Tuomela's (1989) expression). The other mistake is a form of disrespect. Walking off in the middle of the conversation without notification or explanation can display a lack of due respect owed to the other person.",
        "context_notes": "[This introduces the paper's central distinction through a narrative example]",
        "location": "Section 2",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "Basic understanding of joint action and collaborative obligations",
        "mechanism": "Uses a concrete narrative to reveal conceptual distinctions that weren't previously recognized, then explicitly maps the example onto theoretical categories",
        "achievement": "Establishes the core distinction between contribution-failure and respect-failure while making it intuitive through relatable scenario",
        "pattern": "Present concrete case → Identify multiple interpretive possibilities → Map onto distinct theoretical categories → Use distinction to resolve conceptual confusion",
        "domain": "General - applicable to any domain where collaborative relationships involve multiple normative dimensions",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      },
      {
        "move_name": "Reactive Attitudes as Conceptual Diagnostic",
        "quote": "The second piece of evidence for a distinction pertains to the observation that both kinds of failures render different reactive attitudes appropriate. Reactive attitudes like anger and resentment have long been used to track moral wrongdoing (Strawson 2008). Simply disappearing without notification or permission can make moral reactive attitudes and actions appropriate. It would be appropriate for Paula to resent James – not for failing to contribute to their earlier joint intention or for changing his mind – but simply for not respecting her enough to at least notify her when he wishes to end the joint action. In the case of the first failure, it would be inappropriate if Paula were to resent James even before he apologizes and changes the subject. It is not permissible to resent your collaborator for making a mistake relative to the joint intention unless it is done disrespectfully, for example repeatedly and intentionally. What happened in our example was simply a mistake relative to a shared intention. James did not realize that talking politics does not contribute to it. Resentment is misplaced in this case.",
        "context_notes": "[Following the walking example where James both failed to contribute properly and left disrespectfully]",
        "location": "Section 2",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "Understanding of Strawsonian reactive attitudes and their connection to moral responsibility",
        "mechanism": "Uses differential appropriateness of emotional reactions as a test for whether we're dealing with one phenomenon or two distinct ones",
        "achievement": "Provides independent evidence for the conceptual distinction by showing it tracks intuitive differences in warranted emotional responses",
        "pattern": "Propose conceptual distinction → Test by examining what emotional/evaluative responses each category makes appropriate → Use differential appropriateness as evidence for the distinction's validity",
        "domain": "General - any domain where emotional reactions can diagnose normative categories",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      },
      {
        "move_name": "Functional Analysis of Speech Acts",
        "quote": "A third piece of evidence for a distinction is that reactive actions like apologizing in response to each failure serve different functions. Imagine James, after having left without any notification or justification, realizes his wrongdoing and apologizes to Paula. The function of his second apology is different compared with the function of his first apology. The first signaled that he recognized his mistake (relative to their joint intention) and that he had no justification or excuse for it. The apology is not an attempt to fix the moral relationship with Paula. The relationship was not broken. He is not asking for forgiveness and there is no need for it. Whatever he did, it showed no sign of disrespect. It was an innocent mistake. Leaving the joint action without notification and without having discussed it with Paula signals the opposite (unless there is an excuse). It signals that he disregards Paula's legitimate claims. It suggests that he will immediately withdraw from the joint action if it no longer serves his interests. If James apologized later, this would not just have the function of signaling that he understood that his action did not contribute to the joint intention. By leaving, he had already signaled that he changed his mind and no longer had this intention. Instead, an apology would serve the function of repairing his moral relationship with Paula (cf. Walker 2006, Wallace 2019). This also entails a promise to act more respectfully in the future.",
        "context_notes": "[Continues analysis of the James and Paula walking example]",
        "location": "Section 2",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of speech acts and their social functions, basic grasp of moral repair",
        "mechanism": "Analyzes what the same speech act (apology) accomplishes in different contexts to reveal underlying structural differences",
        "achievement": "Shows that identical behaviors serve different functions when addressing different types of failures, supporting the conceptual distinction",
        "pattern": "Identify seemingly identical responses to different failures → Analyze the distinct functions each serves → Use functional differences as evidence for underlying categorical distinctions",
        "domain": "General - applicable wherever speech acts or behaviors serve multiple functions",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      },
      {
        "move_name": "Reductio via Explosion of Wrongdoing",
        "quote": "My response is that such a view would exaggerate the 'wrongness' of an expected and abundant morally innocent type of failure. It would cause an explosion of wronging in joint action. When I do something wrong relative to our joint intention but immediately correct my behaviour, I make a mistake, but I do not wrong my collaborator. Not only is acting in unfortunate ways in good faith expected and normal. To acknowledge the mistake and change one's action is an expression of respect – not wronging. We do not always know how best to fulfil a joint intention and we do not always know in what way the other person would like to fulfil it. For example, if I build a flat-pack bed with my partner and, for some innocent reason, I use the wrong screw, I cause some frustration, but I do not wrong my partner. Such mistakes are bound to happen in any joint action. I do not need an excuse in such a case; I can admit that I made a mistake, say 'sorry' to signal that it was not due to a lack of cooperative intention, and we move on. I would not enter a joint action if I knew I were bound to morally wrong my partner. If we assume a Kantian 'ought implies can' constraint on agency, then I have no obligation to always act perfectly according to our joint intention. This is impossible to achieve.",
        "context_notes": "[Responding to the objection that the two types of failure are just degrees of the same phenomenon]",
        "location": "Section 3",
        "classification": [
          "defensive",
          "offensive"
        ],
        "prerequisites": "Understanding of moral wronging, Kantian 'ought implies can' principle, basic collaborative scenarios",
        "mechanism": "Shows that collapsing the distinction leads to absurd consequences where normal, inevitable mistakes become moral wrongings",
        "achievement": "Defends the distinction by showing that rejecting it makes collaborative action morally hazardous in implausible ways",
        "pattern": "Take opponent's position → Show it implies that common, inevitable, innocent behaviors count as serious moral failures → Conclude this makes the position untenable",
        "domain": "General - applicable wherever distinguishing between error types and moral failures matters",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      },
      {
        "move_name": "Independence Demonstration via Extreme Cases",
        "quote": "Therefore another piece of evidence for a difference in kind rather than degree is that we can easily imagine cases of disrespect where the person who disrespects their collaborator never makes the first mistake and contributes extremely well to the joint intention. This means we can imagine a case where the joint action functions flawlessly in terms of fulfilment of the joint intention but where one person keeps disrespecting the other. We can easily think of examples where disrespect is constant even if the first kind of mistake is nearly absent – where nobody has any grounds to criticize the other except on moral grounds. The simplest example of the phenomenon of disrespect within a well-functioning joint action involves joint actions under coercion. If I force you to converse with me about the government, for example, because I have coercive power over you, I disrespect you because I disregard your rights and interests, say your right to act autonomously. You and I still share the intention to converse about the government but the only reason we share this intention is that I force you to. In other words, while failing to be moral, I may still excel at sustaining this joint action. I can wrong you in the moral sense and still excel at doing my part in the joint action.",
        "context_notes": "[Defending the claim that there are two kinds of failure, not just degrees of one kind]",
        "location": "Section 3",
        "classification": [
          "defensive",
          "constructive"
        ],
        "prerequisites": "Understanding of coercion, autonomy, and the possibility of morally problematic but functionally successful collaborations",
        "mechanism": "Constructs extreme cases where one type of failure is maximized while the other is minimized, showing they can vary independently",
        "achievement": "Proves the failures are categorically distinct by showing they can dissociate completely in extreme scenarios",
        "pattern": "To prove X and Y are distinct types rather than degrees → Construct cases where X is maximal but Y is minimal → Construct cases where Y is maximal but X is minimal → Conclude they must be independent dimensions",
        "domain": "General - applicable to any domain where distinguishing types from degrees matters",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      },
      {
        "move_name": "Theoretical Reconciliation via Conceptual Reframing",
        "quote": "Now recall Gilbert's key objection to reductionist approaches to joint intention that such a view fails to explain how a joint intention can remain in place and be referred to in our justificatory practices even if the participants all changed their minds regarding the continuation of the joint action. My response is that we can demand of the others to stick to the original plan not because the joint intention remains in place but out of respect. Paula can demand of James to slow down not just by referring to a joint intention but simply because it would be respectful to do so. He owes it to her either to slow down or to ask to change their plans out of respect, not because the joint intention is still in place. Thus Bratman can argue that, even if the joint intention no longer exists, we may still owe it to the others to continue, and they have an entitlement to demand certain actions from us because anything else would be disrespectful.",
        "context_notes": "[Gilbert argues that reductionist accounts cannot explain persistent normative claims in joint action; Bratman represents the reductionist position]",
        "location": "Section 4",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "Understanding of the Gilbert-Bratman debate about joint intention and the persistence of normative claims",
        "mechanism": "Reframes a persistent theoretical problem by relocating the source of normative force from one concept (joint intention) to another (respect)",
        "achievement": "Resolves a major theoretical impasse by showing that the reductionist can accommodate the normativist's key intuition using different conceptual resources",
        "pattern": "Identify theoretical deadlock between positions → Introduce new conceptual resource → Show how it allows one position to accommodate the other's key intuition → Resolve the apparent conflict",
        "domain": "General - applicable wherever theoretical disputes involve competing explanations for the same phenomena",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      },
      {
        "move_name": "Empirical Prediction via Theoretical Application",
        "quote": "However, the coercer has no grounds besides the joint intention on which they can make demands. To explain this, the notion of respect is critical again. By forcing me to engage in an immoral joint action, the criminal disrespects me in such a fundamental way that if the gun turns out to be fake, I have of course no obligations towards this person to notify or to seek permission to leave. I can simply leave or even call the police. I predict that lay people will share this intuition. My distinction allows us to see that leaving is not a form of wronging (moral or otherwise). Leaving does not require any special justification as there was no obligation to the criminal to begin with. There was a mistake, but only in the morally innocent first sense of merely failing to act in accordance with the joint intention.",
        "context_notes": "[Discussing coercive joint actions and how they test theories of joint intention normativity]",
        "location": "Section 4",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "Understanding of coercive scenarios and their challenge to theories of joint intention obligations",
        "mechanism": "Uses theoretical framework to generate specific empirical predictions about intuitive responses to extreme cases",
        "achievement": "Demonstrates theoretical power by making testable predictions and using them to support the theoretical framework over competitors",
        "pattern": "Apply theoretical distinction to extreme case → Derive specific prediction about intuitive responses → Use prediction to test theory against alternatives → Present as evidence for theoretical superiority",
        "domain": "General - applicable wherever theories make competing predictions about intuitive responses",
        "quality": "High",
        "source_paper": "Two kinds of failure in joint action: On disrespect and directed duties",
        "source_author": "Guido Löhr"
      }
    ],
    "extraction_notes": "This paper exemplifies sophisticated conceptual analysis through concrete examples. The author's strategy of using a single extended example (James and Paula) to establish multiple lines of evidence for a conceptual distinction is particularly effective. The moves show how to defend new distinctions against both theoretical objections and empirical challenges while maintaining connection to existing debates. The paper demonstrates how introducing new conceptual resources (respect) can resolve apparent theoretical deadlocks.",
    "source_file": "anae045 (1).txt"
  },
  {
    "paper_info": {
      "title": "What is the tertiary norm of belief?",
      "author": "Jorren Dykstra",
      "main_thesis": "Williamson's tertiary norm for belief, when properly understood, is not satisfied in cases of intuitively unjustified belief, so we need other reasons to think it's not justifying."
    },
    "philosophical_moves": [
      {
        "move_name": "Typological Case Construction",
        "quote": "JFB appears to draw support from two kinds of case. In what I will call 'type-1' cases, one's experiences are globally misleading: given an experience with content p, it is the case that not-p, because nothing is as it seems. In what I will call 'type-2' cases, one's experiences are locally misleading: given an experience with content p, it is the case that not-p, because things are not as they seem in the situation, though they are sometimes as they seem. Here is a token of each type: Type-1: A experiences having hands. So A believes that she has hands. Unfortunately A's experiences are simulations fed to her by a supercomputer: A is a brain-in-a-vat (BIV). Type-2: B is at the garden centre. She has the visual experience of a potted plant, p, in the 'real plants' aisle. So B believes that p is a real plant. Unfortunately p is not a real plant: it is a plastic counterfeit.",
        "context_notes": "[JFB is the claim that 'False beliefs can be justified']",
        "location": "Section 1",
        "classification": [
          "constructive"
        ],
        "prerequisites": "A philosophical thesis that needs case-based support",
        "mechanism": "Creates exhaustive categories of relevant cases, then provides concrete instances of each type that clearly instantiate the distinguishing features",
        "achievement": "Organizes the dialectical landscape and provides shared reference points for subsequent argument",
        "pattern": "When defending thesis T with cases, distinguish types of cases that support T in different ways, then provide paradigmatic instances of each type",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      },
      {
        "move_name": "Intuitive Tension Highlighting",
        "quote": "A and B have false beliefs. So these beliefs are bad, in a way. But they are good in a way too. B's belief is hardly negligent: she is in the 'real plants' aisle, and every plant but p is real. A's belief is not just passable, but exemplary: by taking it for granted that her senses put her in touch with the facts when she has, and could have, no indication to the contrary, A's case serves as an example of good perceptual believing. Type-1 and type-2 cases are collectively referred to as bad cases. Bad cases are to be contrasted with good cases, where one's experiences are not misleading: in good cases, the belief turns out to be true. There is something to be said for beliefs in bad cases. But what should we say about them? Are they justified?",
        "context_notes": "[Refers to the brain-in-vat case (A) and fake plant case (B) from previous paragraph]",
        "location": "Section 1",
        "classification": [
          "constructive",
          "meta"
        ],
        "prerequisites": "Cases that seem to pull our intuitions in different directions",
        "mechanism": "Explicitly acknowledges competing evaluative intuitions about the same cases, then frames this tension as the central question",
        "achievement": "Motivates the philosophical problem by showing why it's genuinely puzzling rather than obviously decidable",
        "pattern": "When cases generate conflicting intuitions, explicitly acknowledge both sides ('bad in a way... but good in a way too') then pose the question this tension generates",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      },
      {
        "move_name": "Charitable Reinterpretation Strategy",
        "quote": "It is not my goal to argue that JFB is true. Instead I want to get clear on the most charitable way of representing the standard argument in Williamson's framework. The reward for doing so is a new perspective on the intuition that false beliefs can be justified: if the circumstances are right, a false belief can manifest a disposition to know, or to have, only true beliefs.",
        "context_notes": "[JFB is 'False beliefs can be justified'; the standard argument supports JFB using bad cases]",
        "location": "Section 1",
        "classification": [
          "meta",
          "constructive"
        ],
        "prerequisites": "A disagreement between one's own position and an opponent's framework",
        "mechanism": "Explicitly disavows trying to win the argument, instead commits to finding the strongest interpretation of opponent's view within their own framework",
        "achievement": "Shifts focus from victory to understanding while promising novel insights from the charitable interpretation",
        "pattern": "Rather than argue directly for thesis T, seek the most charitable way to represent arguments for T within opponent's framework, promising new insights from this exercise",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      },
      {
        "move_name": "Norm Hierarchy Construction",
        "quote": "Williamson distinguishes three kinds of norm for belief. The primary norm is that one ought to know p if one believes p. The secondary norm is that one ought to believe p only if one knows p. And the tertiary norm is that one ought to believe p only if one is in a position to know p. Each norm corresponds to an evaluation of belief. A belief is justified if it satisfies the primary norm: one ought to know what one believes, and one does. A belief is blameless if it satisfies the secondary norm: one ought to believe only what one knows, and one does. And a belief is excused if it satisfies the tertiary norm: one ought to believe only what one is in a position to know, and one does.",
        "context_notes": "[This presents Williamson's three-norm framework for evaluating beliefs]",
        "location": "Section 2",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Recognition that there might be multiple standards for evaluating the same type of thing",
        "mechanism": "Systematically distinguishes three related but distinct norms, then maps each norm to a specific type of evaluation",
        "achievement": "Creates a structured framework that can handle nuanced evaluations while maintaining clear conceptual distinctions",
        "pattern": "When dealing with complex evaluative concepts, distinguish multiple related norms in a hierarchy, then map each norm to its corresponding evaluation",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      },
      {
        "move_name": "Counterexample via Norm Misapplication",
        "quote": "Consider Williamson's rough-and-ready formulation of the tertiary norm: one ought to believe p only if one is in a position to know p. Return to our BIV, A. A believes that she has hands. Is A in a position to know that she has hands? Williamson says no. A cannot know that she has hands because it is false that she has hands, and one cannot know what is false. So A's belief that she has hands violates the tertiary norm. But intuitively, A's belief is excused, or justified. So satisfying the tertiary norm is not sufficient for a belief to be excused, or justified.",
        "context_notes": "[A is the brain-in-vat case from earlier; the tertiary norm is 'believe p only if in position to know p']",
        "location": "Section 3",
        "classification": [
          "offensive"
        ],
        "prerequisites": "A proposed norm and an intuitive evaluation that should follow from satisfying that norm",
        "mechanism": "Shows that the proposed norm, applied to a clear case, generates the wrong verdict about whether the evaluation applies",
        "achievement": "Undermines the adequacy of the proposed norm by showing it fails to track our clear intuitions",
        "pattern": "To challenge norm N that supposedly justifies evaluation E, find a case where N is violated but E still intuitively applies, or where N is satisfied but E doesn't apply",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      },
      {
        "move_name": "Precisification Defense",
        "quote": "I think that this objection conflates being in a position to know with being able to know. Here is a more careful statement of the tertiary norm: (TN) One ought to: believe p only if one would know p in the nearest possible worlds where p is true. In the nearest possible worlds where A has hands, A knows that she has hands (via the same kind of perceptual process that, in the actual world, generates her belief that she has hands). So A's belief that she has hands does satisfy TN. The same is true of B. In the nearest possible worlds where plant p is real, B knows that p is real. So B's belief that p is real also satisfies TN.",
        "context_notes": "[A is brain-in-vat case, B is fake plant case; the objection claimed their beliefs violate the tertiary norm]",
        "location": "Section 4",
        "classification": [
          "defensive"
        ],
        "prerequisites": "An objection based on alleged counterexamples to one's preferred formulation",
        "mechanism": "Distinguishes two similar but importantly different concepts, then reformulates the original principle using the more precise concept",
        "achievement": "Shows that the counterexamples fail against the properly understood principle",
        "pattern": "When faced with counterexamples to principle P, distinguish between concept C (used in objection) and concept C* (what P really requires), then show counterexamples fail against P reformulated with C*",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      },
      {
        "move_name": "Modal Reformulation Strategy",
        "quote": "Here is a more careful statement of the tertiary norm: (TN) One ought to: believe p only if one would know p in the nearest possible worlds where p is true. In the nearest possible worlds where A has hands, A knows that she has hands (via the same kind of perceptual process that, in the actual world, generates her belief that she has hands). So A's belief that she has hands does satisfy TN. The same is true of B. In the nearest possible worlds where plant p is real, B knows that p is real. So B's belief that p is real also satisfies TN.",
        "context_notes": "[This is defending against Williamson's objection to the tertiary norm in bad cases]",
        "location": "Section 4",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "A dispositional or counterfactual concept that needs precise formulation",
        "mechanism": "Reformulates the concept in terms of what happens in nearest possible worlds where certain conditions obtain",
        "achievement": "Provides precise content for dispositional concepts while preserving intuitive verdicts about cases",
        "pattern": "To precisify dispositional concept 'S is disposed to φ', reformulate as 'S would φ in the nearest possible worlds where the triggering conditions obtain'",
        "domain": "General",
        "quality": "High",
        "source_paper": "What is the tertiary norm of belief?",
        "source_author": "Jorren Dykstra"
      }
    ],
    "extraction_notes": "This paper demonstrates sophisticated defensive philosophy, using precisification and modal reformulation to protect intuitive positions against technical objections. The moves show how to construct taxonomies of cases, acknowledge tensions, and provide charitable reinterpretations while maintaining rigorous conceptual distinctions.",
    "source_file": "anad104 (1).txt"
  },
  {
    "paper_info": {
      "title": "A note on the Wilhelmine Inconsistency",
      "author": "Jon Erling Litland",
      "main_thesis": "The Wilhelmine Inconsistency should not worry grounding enthusiasts because there are natural ground-theoretic accounts that resolve it by rejecting either double negation principles or propositional identity principles."
    },
    "philosophical_moves": [
      {
        "move_name": "Technical Inconsistency Deflationary Response",
        "quote": "Wilhelm (2021) has recently shown that certain widely accepted grounding principles are inconsistent with standard principles of propositional identity; call this the Wilhelmine Inconsistency. The proof of the inconsistency is unimpeachable, but what is its import? This note argues that – unlike the puzzles of ground (Fine 2010) and the Russell-Myhill paradoxes for ground (Fritz forthcoming) – the Wilhelmine Inconsistency should not worry grounding enthusiasts. This is established by sketching two natural ground-theoretic accounts of propositional identity, and showing that on one account a grounding principle is clearly incorrect, and that on the other account the principles of propositional identity are clearly incorrect.",
        "context_notes": "",
        "location": "Section 1",
        "classification": [
          "defensive",
          "meta"
        ],
        "prerequisites": "Understanding of grounding theory and acceptance that Wilhelm has proven an inconsistency",
        "mechanism": "Concedes the technical result but argues it lacks philosophical significance by showing multiple principled ways to resolve it",
        "achievement": "Deflates apparent threat to grounding theory by showing the inconsistency can be resolved without abandoning core commitments",
        "pattern": "When faced with technical inconsistency: (1) Accept the formal result, (2) Question its philosophical import, (3) Show multiple principled resolutions exist",
        "domain": "General - applicable to any formal inconsistency in philosophical theory",
        "quality": "High",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      },
      {
        "move_name": "Disjunctive Identity Criterion for Edge Cases",
        "quote": "A naïve ground-theoretic identity-criterion holds that propositions are individuated by specifying their immediate possible grounds: two propositions are identical iff they have exactly the same immediate full grounds. But since all ungrounded propositions have the same grounds – none! – this naïve identity criterion yields the absurd consequence that there is only one ungrounded proposition. We cannot establish priority monism so easily! A natural response is to take a disjunctive approach: the identities of ungrounded propositions are simply taken for granted, and the criterion of identity only applies to grounded propositions.",
        "context_notes": "",
        "location": "Section 3.1",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "Understanding that identity criteria must handle edge cases and that ungrounded propositions pose special problems",
        "mechanism": "Identifies problematic edge case, shows it leads to absurd consequence, then proposes treating edge cases differently from standard cases",
        "achievement": "Saves the general identity criterion by carving out special treatment for problematic cases",
        "pattern": "When identity criterion fails for edge cases: (1) Show absurd consequence, (2) Propose disjunctive treatment separating edge cases from normal cases",
        "domain": "General - applicable to any identity criterion facing edge case problems",
        "quality": "High",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      },
      {
        "move_name": "Bipolar Metaphysical Unification",
        "quote": "The resulting view yields a kind of bipolar account of propositions. A proposition p and its negation are just two ways of looking at a single division in logical space. This account is, of course, reminiscent of a truthmaker account of propositions on which propositions having the same truthmakers and falsemakers are identified; but – since we accept the ideology of immediate ground – we can draw finer distinctions. Unlike the truthmaker theorist we distinguish between p & (q & r) and (p & q) & r: the former is immediately grounded in q & r, while the latter is not.",
        "context_notes": "[Context: The unstructured criterion treats propositions as individuated by their grounds and antigrounds, leading to p ≈ ∼∼p]",
        "location": "Section 3.2",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of the unstructured identity criterion and how it treats negation",
        "mechanism": "Presents metaphysical picture where apparent opposites are unified as aspects of single entity, then distinguishes from similar views",
        "achievement": "Provides intuitive metaphysical picture supporting the technical account while showing its advantages over competitors",
        "pattern": "Present unifying metaphysical picture for technical account: (1) Describe the unification, (2) Compare to similar views, (3) Show distinctive advantages",
        "domain": "General - applicable when technical accounts need intuitive metaphysical support",
        "quality": "Medium",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      },
      {
        "move_name": "Operational Definition by Grounding Profile",
        "quote": "On the present structured account ground and antiground enter the picture in the definitions of the logical operations themselves – the idea being that a logical operation is defined by the contribution it makes to how propositions containing it are grounded and antigrounded. In a slogan: logical operations are individuated by their Grounding Profile. The clause for negation is straightforward. Negation is that operation ∼ such that for all propositions p (i) the immediate grounds for ∼p are exactly the antigrounds for p; and (ii) the unique antiground for ∼p is exactly p.",
        "context_notes": "[Context: This is the structured criterion which maintains that propositions have logical operations as constituents]",
        "location": "Section 3.3",
        "classification": [
          "constructive"
        ],
        "prerequisites": "Understanding of structured view of propositions and the concept of grounding profiles",
        "mechanism": "Defines abstract operations by specifying their systematic contribution to grounding relations, encapsulated in memorable slogan",
        "achievement": "Provides precise definitions of logical operations that justify the desired grounding principles",
        "pattern": "Define abstract operations by their systematic effects: (1) State general principle as slogan, (2) Give precise clauses for each operation, (3) Show how clauses justify desired principles",
        "domain": "Logic and metaphysics - applicable to defining logical or metaphysical operations",
        "quality": "High",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      },
      {
        "move_name": "Preemptive Objection Handling",
        "quote": "Finally, while Wilhelm does not explicitly argue for (∨-defines-&) and (&-defines-∨), one might perhaps extract an argument from his observation that the former defines conjunction in terms of disjunction while the latter does the opposite. To explore this suggestion let us define an operation &? as follows. &? ≈ λpq. ∼(∼p ∨ ∼q). It follows that p &? q ≈ ∼(∼p ∨ ∼q). That is, we have (∨-defines-&) for &?. And now one might worry: together with (∨−) and (&+), (∨-defines-&) suffices to establish that every proposition is identical to its double negation. However, there is no cause for worry since the principle (&+) (for &?) fails.",
        "context_notes": "[Context: This addresses potential objection to the structured account which rejects the identity principles (∨-defines-&) and (&-defines-∨)]",
        "location": "Section 3.3",
        "classification": [
          "defensive"
        ],
        "prerequisites": "Understanding of the structured account and the original inconsistency argument",
        "mechanism": "Anticipates unstated objection, reconstructs strongest version of it, then shows why the objection fails on the proposed view",
        "achievement": "Deflects potential criticism and demonstrates robustness of the structured account",
        "pattern": "Handle potential objections: (1) Reconstruct unstated but natural objection, (2) Show how objection would work, (3) Demonstrate why it fails on your view",
        "domain": "General - applicable when defending any philosophical position against potential objections",
        "quality": "High",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      },
      {
        "move_name": "Comparative Advantage Through Concrete Cases",
        "quote": "Second, the structured account arguably has an advantage in its treatment of set existence. Let a, b be two objects that do not have a part in common and consider the fusion c = a + b. The natural view about the existence of fusions is that c is grounded in the existence of a, b (taken together) and antigrounded in each of ∼Ea and ∼Eb. According to the unstructured view the proposition that c exists is then identical to the proposition that {a, b} exists. On the structured view, on the other hand, these two propositions are readily distinguished by their having different constituents.",
        "context_notes": "[Context: Comparing the structured account (which keeps propositions distinct based on constituents) with the unstructured account (which identifies propositions with same grounds/antigrounds)]",
        "location": "Section 3.3",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "Understanding of both structured and unstructured accounts and basic mereology",
        "mechanism": "Constructs concrete case where competing theories give different verdicts, then argues one verdict is more plausible than the other",
        "achievement": "Provides reason to prefer structured account over unstructured account beyond mere consistency",
        "pattern": "Show theoretical advantage through concrete cases: (1) Find case where theories diverge, (2) Show what each theory predicts, (3) Argue one prediction is more plausible",
        "domain": "General - applicable for comparing any competing philosophical theories",
        "quality": "Medium",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      },
      {
        "move_name": "Principled Resolution Strategy",
        "quote": "Since both the structured and unstructured accounts provide principled ways of responding to the Wilhelmine Inconsistency, grounding enthusiasts need not worry too much about this inconsistency: either they can drop the claim that double negations of propositions are grounded in those propositions, or they can drop the identifications of conjunctions with certain negated disjunctions and disjunctions with certain negated conjunctions. Of course, the defender of ground cannot rest content with this – for two reasons. First, the structured and unstructured accounts are in conflict: one ultimately has to choose between them. Second, one has to show how the accounts deal with the other puzzles of ground.",
        "context_notes": "",
        "location": "Section 4",
        "classification": [
          "meta",
          "constructive"
        ],
        "prerequisites": "Understanding of both proposed solutions to the inconsistency",
        "mechanism": "Shows multiple principled solutions exist, declares victory, but immediately acknowledges remaining work and limitations",
        "achievement": "Establishes that the inconsistency is not devastating while maintaining intellectual honesty about unresolved issues",
        "pattern": "Principled resolution summary: (1) Show multiple solutions exist, (2) Declare immediate problem solved, (3) Acknowledge further work needed, (4) Specify what that work involves",
        "domain": "General - applicable when offering solutions to philosophical problems",
        "quality": "High",
        "source_paper": "A note on the Wilhelmine Inconsistency",
        "source_author": "Jon Erling Litland"
      }
    ],
    "extraction_notes": "This paper demonstrates sophisticated defensive philosophy, showing multiple ways to preserve a philosophical framework when faced with formal inconsistency. The moves combine technical precision with broader theoretical vision, and several patterns (especially the deflationary response and operational definition strategies) could be widely applicable in analytic philosophy.",
    "source_file": "anab048.txt"
  },
  {
    "paper_info": {
      "title": "Divine hiddenness or de jure objections to theism: You cannot have both",
      "author": "Perry Hendricks",
      "main_thesis": "Accepting the argument from divine hiddenness eliminates all de jure objections to theism, so atheists must choose between them."
    },
    "philosophical_moves": [
      {
        "move_name": "Forced Choice Dilemma",
        "quote": "De facto objections to theism purport to show that theism is false, whereas de jure objections to theism claim that, whether or not theism is true, belief in God is irrational. Divine hiddenness – the (supposed) fact that there are people who non-resistantly lack belief in God – is sometimes used as an argument against theism. In this article I show that accepting the argument from divine hiddenness carries a high cost: it eliminates all de jure objections to theism. So atheists can either have de jure objections to theism or the objection from divine hiddenness, but they cannot have both.",
        "context_notes": "[No additional context needed - this is the opening framing]",
        "location": "Introduction",
        "classification": [
          "offensive",
          "meta"
        ],
        "prerequisites": "Understanding the distinction between de facto and de jure objections",
        "mechanism": "Frames the debate as a forced choice between two incompatible positions, making opponents choose which of their weapons to abandon",
        "achievement": "Puts atheists in a strategic bind and previews the main argument structure",
        "pattern": "Show that Position A commits you to principles that undermine Position B, forcing opponents to choose between valued commitments",
        "domain": "General - applicable to any domain where positions might have hidden tensions",
        "quality": "High",
        "source_paper": "Divine hiddenness or de jure objections to theism: You cannot have both",
        "source_author": "Perry Hendricks"
      },
      {
        "move_name": "Commitment Extraction",
        "quote": "Undergirding the argument from divine hiddenness, in both its probabilistic and traditional formulation, is the thought that God's perfect love entails that he would (at least) probably seek to be in a relationship with all those who are capable and not resistant to being in a relationship with him, and that to be in a relationship with God one must believe he exists. So God will (at least) probably ensure that those seeking a relationship with him believe that he exists. This entails the following thesis: (H) God probably would either (a) directly cause (among those who are non-resistant) belief in him or (b) provide those who are nonresistant with an ability to form beliefs about him. If one rejects (H), then it is hard to see how the argument from divine hiddenness, in either its probabilistic or traditional form, could be sustained.",
        "context_notes": "[The argument from divine hiddenness claims God's perfect love would prevent non-resistant nonbelief]",
        "location": "Section 2",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "Understanding the divine hiddenness argument and its relationship to God's perfect love",
        "mechanism": "Identifies the essential logical commitment underlying various formulations of an argument and shows this commitment is necessary for the argument's success",
        "achievement": "Pins down exactly what defenders of divine hiddenness must accept, setting up the later refutation",
        "pattern": "Extract the minimal essential commitment that Position X requires, showing that rejecting this commitment undermines Position X entirely",
        "domain": "General - applicable to any complex argument with multiple formulations",
        "quality": "High",
        "source_paper": "Divine hiddenness or de jure objections to theism: You cannot have both",
        "source_author": "Perry Hendricks"
      },
      {
        "move_name": "Conditional Rationality Argument",
        "quote": "Plantinga has argued that if God exists, then belief in God is probably rational. His argument goes like this: if theistic belief is true, then it seems likely that it does have warrant. If it is true, then there is, indeed, such a person as God, a person who has created us in his image, who loves us, who desires that we know and love him. But if these things are so, then he would of course intend that we be able to be aware of his presence and to know something about him. And if that is so, the natural thing to think is that he created us in such a way that we would come to hold such true beliefs about God. The basic idea here is that if God exists, then he has created us in his image, desires for us to know him, and this means that God would probably have created us with an ability to know him. We may simplify Plantinga's thesis to this: (P) If God exists, then theistic belief is probably formed by properly functioning, reliable faculties.",
        "context_notes": "[This summarizes Plantinga's argument that the truth of theism entails its probable rationality]",
        "location": "Section 3",
        "classification": [
          "constructive",
          "defensive"
        ],
        "prerequisites": "Understanding warrant theory and the distinction between truth and rationality",
        "mechanism": "Argues that if a belief is true under certain conditions, then those same conditions make the belief rational, collapsing the distinction between truth and justified belief",
        "achievement": "Eliminates pure de jure objections by showing that God's existence entails the rationality of belief in God",
        "pattern": "If Condition C makes Proposition P true, then Condition C also makes belief in P rational, eliminating objections to P's rationality that don't also challenge P's truth",
        "domain": "Epistemology - but transferable to other domains where truth and rationality might be linked",
        "quality": "High",
        "source_paper": "Divine hiddenness or de jure objections to theism: You cannot have both",
        "source_author": "Perry Hendricks"
      },
      {
        "move_name": "Bridge Argument via Shared Requirements",
        "quote": "The route from (H) to (P) is fairly simple: if (a) of (H) holds, then one's belief in God will be formed reliably (God directly producing belief in him is, of course, completely reliable), and if (b) of (H) holds, then God has provided humans with an ability to form beliefs about him. But the adherent of (H) must hold that the beliefs formed by the ability God has provided humans with are reliably formed, since these beliefs need to form the basis of a conscious, reciprocal and positively meaningful relationship with God. In other words, a conscious, reciprocal and positively meaningful relationship with God requires one's beliefs to be reliably formed: I must be able to recognize certain things about God, respond appropriately and so on, and this requires that my 'God-belief forming ability' is reliable.",
        "context_notes": "[H is the divine hiddenness commitment that God would ensure non-resistant people can form beliefs about him; P is Plantinga's thesis about reliable belief formation]",
        "location": "Section 3",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "Understanding both the divine hiddenness argument's commitments and Plantinga's rationality argument",
        "mechanism": "Shows that two apparently independent positions share a common requirement, making acceptance of one position commit you to the other",
        "achievement": "Demonstrates that divine hiddenness proponents must accept the very principle that eliminates de jure objections",
        "pattern": "Show that Position A and Position B both require the same underlying condition C, so accepting A commits you to accepting B",
        "domain": "General - applicable whenever positions have hidden shared requirements",
        "quality": "High",
        "source_paper": "Divine hiddenness or de jure objections to theism: You cannot have both",
        "source_author": "Perry Hendricks"
      },
      {
        "move_name": "Functional Reliability Argument",
        "quote": "Put differently: if God has given me an ability to form beliefs about him for the purpose of creating and maintaining a relationship with him, then the ability will be reliable, for otherwise it would not accomplish its purpose. (The same, of course, goes for if the belief was caused directly by God.) So it seems clear that (H) entails (P). However, if this is the case, then those who accept (H) must reject all de jure objections to theism: since (P) does away with all de jure objections to theism, and (H) entails (P), (H) does away with all such objections as well.",
        "context_notes": "[This follows the bridge argument showing that divine hiddenness commitments entail Plantinga's rationality thesis]",
        "location": "Section 3",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "Understanding that cognitive abilities designed for specific purposes must be reliable to fulfill those purposes",
        "mechanism": "Argues that any cognitive ability designed by God for relationship-formation must be reliable, since unreliable abilities couldn't accomplish their intended function",
        "achievement": "Completes the argument that divine hiddenness undermines de jure objections through transitivity",
        "pattern": "If Agent A designs Mechanism M for Purpose P, then M must be reliable/effective, otherwise A would be irrational or incompetent",
        "domain": "Philosophy of mind and design arguments - but transferable to contexts involving purposeful design",
        "quality": "High",
        "source_paper": "Divine hiddenness or de jure objections to theism: You cannot have both",
        "source_author": "Perry Hendricks"
      },
      {
        "move_name": "Probabilistic Hedging Strategy",
        "quote": "However, one need not state the argument in such strong terms: if stated probabilistically, its plausibility is increased. For example, one might argue that if God exists, then probably there would not be non-resistant non-belief. Felipe Leon does just this, and states his probabilistic version of it as follows: (1) If [God] exists, then we'd expect that God would meet all the prerequisites for all those who would want a voluntary relationship with him... (4) Therefore, [non-resistant non-belief] provide[s] some evidence against [God].",
        "context_notes": "[This follows discussion of the traditional strong formulation of divine hiddenness that claims God would necessarily prevent non-resistant nonbelief]",
        "location": "Section 2",
        "classification": [
          "defensive",
          "constructive"
        ],
        "prerequisites": "Understanding the difference between necessary and probabilistic claims in philosophical arguments",
        "mechanism": "Weakens a controversial strong claim to a more modest probabilistic version to avoid obvious counterexamples while preserving argumentative force",
        "achievement": "Makes the divine hiddenness argument more defensible by reducing its commitments",
        "pattern": "When facing objections to strong claim 'X necessarily implies Y', retreat to weaker 'X probably implies Y' or 'X provides evidence for Y'",
        "domain": "General - applicable to any argument making strong modal or universal claims",
        "quality": "Medium",
        "source_paper": "Divine hiddenness or de jure objections to theism: You cannot have both",
        "source_author": "Perry Hendricks"
      }
    ],
    "extraction_notes": "This paper demonstrates a sophisticated dialectical strategy: rather than directly attacking the divine hiddenness argument, Hendricks shows it has costly implications that its proponents likely didn't recognize. The moves focus heavily on extracting commitments and showing hidden connections between positions, which is a powerful technique for philosophical criticism.",
    "source_file": "anaa043.txt"
  },
  {
    "paper_info": {
      "title": "Philosophy moves and meta-moves",
      "author": "David Kelley",
      "main_thesis": "Philosophers employ recognizable argumentative techniques ('moves') that can be catalogued, abstracted, and redeployed across different philosophical debates."
    },
    "philosophical_moves": [
      {
        "move_name": "Meta-Question Shift",
        "quote": "Why is this question so interesting or puzzling in the first place? What different responses might we be soliciting when posing the question? Moves are sometimes useful for their ability to push through stalemates by posing broader related questions. This move – 'Meta-Question Shift' – invites us to probe a topic in the literature that enjoys a traditional articulation of its central problem. When we make this move, we examine not the content of the topic but the way we have hitherto been posing the central question about the target of our analysis. For example, we might be interested in quite distinct things when we pose the question 'what is consciousness?' Or when someone asks 'what is life?', one may have a very different question in mind from someone else investigating the same question. Shifting to the meta-question allows us to consider and potentially disentangle the distinct motivations and intentions behind the questions, as well as the different understandings of the problem. Do we want to know what causes consciousness? Do we want to know what sorts of things are conscious? Are we wondering how consciousness is consistent with a naturalistic worldview?",
        "context_notes": "",
        "location": "Section 2.1",
        "classification": [
          "meta",
          "constructive"
        ],
        "prerequisites": "An established philosophical debate with a traditional central question that has reached a stalemate or lacks progress",
        "mechanism": "Steps back from the content-level debate to examine the framing question itself, revealing hidden assumptions and distinct motivations behind the apparently unified question",
        "achievement": "Breaks through stalemates by revealing that debaters may be pursuing fundamentally different questions, potentially opening new avenues of inquiry",
        "pattern": "When debate X stagnates, ask: 'Why is question X interesting/puzzling?' and 'What different things might people mean when asking X?'",
        "domain": "General - applicable across all philosophical areas",
        "quality": "High",
        "source_paper": "Philosophy moves and meta-moves",
        "source_author": "David Kelley"
      },
      {
        "move_name": "Concept Elimination",
        "quote": "This concept is incoherent, has no referent, or holds no promise for doing the work we thought it would. We should dispense with it altogether. In the 1980s, Paul and Patricia Churchland famously advanced a view called 'Eliminative Materialism', which holds that our common descriptions of the mind are false. Our folk theories misrepresent actual neural processes and, as a result, our chunking of psychological phenomena is misguided. A recent example can be found within the philosophy of biology, where Carlos Santana argues that the concept of biodiversity is just not useful. 'Biodiversity' is an eliminable stand-in for what we really care about: 'biological value'. It would be better to identify what we value and work to prioritize its conservation directly, whether that be the aesthetic sublimity of wilderness, the health benefits of clean air or the scientific value of rare and interesting types of living systems. The potential advantage of making this move is that it may inspire a radical and exciting re-conceptualization of a topic. By making this move, one invites others to dispense with a concept that may be holding up new insights, innovations and conceptual headway.",
        "context_notes": "",
        "location": "Section 2.2",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "A central concept in an established debate that appears problematic, incoherent, or unhelpful",
        "mechanism": "Argues that a concept is so fundamentally flawed that it should be abandoned entirely rather than revised, typically offering an alternative framework",
        "achievement": "Clears conceptual deadwood and potentially opens space for radical reconceptualization of a domain",
        "pattern": "Concept X is incoherent/unhelpful/without referent → abandon X entirely → replace with alternative framework Y",
        "domain": "General - applicable wherever concepts become problematic obstacles",
        "quality": "High",
        "source_paper": "Philosophy moves and meta-moves",
        "source_author": "David Kelley"
      },
      {
        "move_name": "Substance to Process Reconceptualization",
        "quote": "The phenomenon of concern has traditionally been conceptualized in terms of 'stuff'. But it might better be thought of as a process. You might think that whatever an organism is, it is a thing – an organism. But the individuality of an organism is maintained by the stable processes of its component parts. Accordingly, some philosophers of biology invite us to think of organisms as processes. Nicholson argues that 'the thermodynamic character of life demands a processual conception of the organism'. Organisms are not (simply) stuff; they are 'highly stabilized flows of energy and matter'. On this view, enduring organisms that persist through time and move in space should be considered abstractions from these stable processes. The explanation of why we apprehend an organism as a static object is near oxymoronic: because it is always changing. Organisms are characterized by continual material change with continual structural stability. More generally, a processual ontology will emphasize that the world is always changing. While thinking of patterns of processes as fixed objects will be useful in many cases, other times it will be more appropriate to retain a picture of inherent change.",
        "context_notes": "",
        "location": "Section 2.3",
        "classification": [
          "constructive",
          "offensive"
        ],
        "prerequisites": "A domain where phenomena are traditionally conceived as static entities or 'things'",
        "mechanism": "Challenges substance-based thinking by reframing static entities as dynamic processes that achieve stability through constant change",
        "achievement": "Reveals temporal/dynamic aspects hidden by substance-thinking and potentially resolves puzzles about identity and change",
        "pattern": "X appears to be a static thing → but X is better understood as a dynamic process → this explains apparent puzzles about X's persistence/identity",
        "domain": "General - applicable to metaphysical questions across domains",
        "quality": "High",
        "source_paper": "Philosophy moves and meta-moves",
        "source_author": "David Kelley"
      },
      {
        "move_name": "Tripartite Distinction Meta-Move",
        "quote": "Within the interdisciplinary debate about the definition of life, some have opted to shift to the meta-question, why is defining life so challenging? To investigate this question, Malaterre and Chartier make an additional move: the Tripartite Distinction. The authors disambiguate three distinct questions to engage with. The Ontological Question: Is life a natural kind? The Epistemological Question: Given current knowledge, can we define life? The Methodological Question: What is the most appropriate way to answer the question, 'what is life'? Making the first move (Meta-Question Shift) allows us to take a step back and think about how we have been approaching the first-order question, what is life? Then the second move (the Tripartite Distinction) further allows us not only to see distinct questions that sometimes motivate the first-order question, but also to recognize questions of different kinds – those regarding the nature of what is, what we can know and what methods we should use.",
        "context_notes": "[Context: This combines the Meta-Question Shift with the Tripartite Distinction move]",
        "location": "Section 3",
        "classification": [
          "meta",
          "constructive"
        ],
        "prerequisites": "A complex philosophical question that has proven difficult to resolve and involves multiple types of concerns",
        "mechanism": "First steps back to examine why the question is difficult (Meta-Question Shift), then organizes the complexity by distinguishing ontological, epistemological, and methodological dimensions",
        "achievement": "Transforms a confusing complex debate into an organized analysis with clear distinct sub-questions of different logical types",
        "pattern": "Why is question X so difficult? → Separate X into: What exists? (ontological), What can we know? (epistemological), How should we investigate? (methodological)",
        "domain": "General - applicable to complex interdisciplinary questions",
        "quality": "High",
        "source_paper": "Philosophy moves and meta-moves",
        "source_author": "David Kelley"
      },
      {
        "move_name": "Pluralism Plus Concept Elimination",
        "quote": "Concept Elimination may sometimes be thought of as going hand in hand with Pluralism. You eliminate the dominant concept, and it is replaced by several alternatives. For example, in the context of the species debate, Marc Ereshefsky advances Pluralism and Concept Elimination together: 'Eliminate the term \"species\" and replace it with a plurality of more accurate terms'. There is no agreed-upon species concept. Some say a species refers to an interbreeding population. Others say species should be understood in terms of evolutionary relationships (phylogeny). There are many other candidate species concepts on offer. A pluralist approach recognizes distinct species concepts, each valuable in some domain or for some purpose.",
        "context_notes": "[Context: This discusses combining the Concept Elimination move with Pluralism as a meta-strategy]",
        "location": "Section 3",
        "classification": [
          "offensive",
          "constructive"
        ],
        "prerequisites": "A debate with a contested central concept that has multiple competing alternatives, none of which can claim exclusive authority",
        "mechanism": "Eliminates the problematic unifying concept while simultaneously embracing multiple replacement concepts, each suited to different purposes or domains",
        "achievement": "Resolves conceptual disputes by abandoning the assumption that there must be one correct concept, while preserving the insights of competing approaches",
        "pattern": "Concept X is problematic and has multiple competing alternatives → Eliminate X as a unifying concept → Replace with pluralistic framework recognizing distinct concepts for different purposes",
        "domain": "General - applicable where conceptual unity is problematic but alternatives exist",
        "quality": "Medium",
        "source_paper": "Philosophy moves and meta-moves",
        "source_author": "David Kelley"
      },
      {
        "move_name": "Tool Recognition and Abstraction",
        "quote": "Philosophers philosophize using a suite of timeless tools: recognizing or offering relevant distinctions, attempting definitions and revising according to counter-examples, constructing useful thought experiments to clarify and challenge our intuitions, presenting arguments by analogy to relate new subjects to old, among other methods. Reading through the philosophical literature, one will likely have noticed certain types of objections, certain types of replies to objections, certain ways to understand some proposition or theory or even patterns throughout entire exchanges from several authors engaged in debate. One may identify useful tropes within philosophical discourse and catalogue them as potential 'moves' for deployment in various other debates. Moves are recognizable chunks of an argument or debate, abstracted from some context and put to work in another. Hence we often talk about the move one can make in response to an interlocutor's challenge, perhaps contrasting with other available moves not made.",
        "context_notes": "",
        "location": "Section 1",
        "classification": [
          "meta",
          "constructive"
        ],
        "prerequisites": "Familiarity with philosophical literature and recognition of recurring argumentative patterns",
        "mechanism": "Identifies recurring argumentative patterns across different philosophical contexts, abstracts them from their original contexts, and catalogues them as reusable tools",
        "achievement": "Builds a toolkit of philosophical techniques that can be consciously deployed in novel contexts, making philosophical methodology more explicit and teachable",
        "pattern": "Notice recurring pattern P in philosophical arguments → Abstract P from its specific contexts → Catalogue P as a reusable move → Deploy P in new contexts",
        "domain": "Meta-philosophical - about philosophical methodology itself",
        "quality": "High",
        "source_paper": "Philosophy moves and meta-moves",
        "source_author": "David Kelley"
      }
    ],
    "extraction_notes": "This paper is explicitly meta-philosophical, focusing on the methodology of philosophy itself. The moves extracted demonstrate both first-order philosophical techniques and second-order reflection on how moves can be combined and used strategically. The paper exemplifies its own thesis by cataloguing moves that can be abstracted and reused across different philosophical contexts.",
    "source_file": "anae047 (1).txt"
  }
]